In [13]:
import pandas as pd
import numpy as np
from sklearn import linear_model
import math as ma
from word2number import w2n

In [25]:
hiring=pd.read_csv("D:\SimpliLearn\Python\ML\hiring.csv")

In [26]:
hiring

  experience  test_score  interview  salary
0        NaN         8.0          9   50000
1        NaN         8.0          6   45000
2       five         6.0          7   60000
3        two        10.0         10   65000
4      seven         9.0          6   70000
5      three         7.0         10   62000
6        ten         7.0          7   72000
7     eleven         NaN          8   80000

In [27]:
#find mean value
mean_test_score=ma.floor(hiring.test_score.mean())
mean_test_score

7

In [28]:
#value assign 
hiring.test_score=hiring.test_score.fillna(mean_test_score)

In [29]:
hiring

  experience  test_score  interview  salary
0        NaN         8.0          9   50000
1        NaN         8.0          6   45000
2       five         6.0          7   60000
3        two        10.0         10   65000
4      seven         9.0          6   70000
5      three         7.0         10   62000
6        ten         7.0          7   72000
7     eleven         7.0          8   80000

In [34]:
#eneter zero at the nan values unexperience

hiring.experience=hiring.experience.fillna("zero")
#hiring

# use from word2number import w2n to convet the experience string into num
hiring.experience=hiring.experience.apply(w2n.word_to_num)
hiring

   experience  test_score  interview  salary
0           0         8.0          9   50000
1           0         8.0          6   45000
2           5         6.0          7   60000
3           2        10.0         10   65000
4           7         9.0          6   70000
5           3         7.0         10   62000
6          10         7.0          7   72000
7          11         7.0          8   80000

In [45]:
#create regression model
reg=linear_model.LinearRegression()
reg.fit(hiring[['experience','test_score','interview']],hiring['salary'])

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [46]:
#check coeff.
reg.coef_    #coeff. in this are m1+m2+m3
#formula of multi reg is # Y= m1x1+m2x2+m3x3+b

array([2922.26901502, 2221.30909959, 2147.48256637])

In [47]:
#b is the intercept
reg.intercept_

14992.65144669314

In [50]:
#now predict
reg.predict([[4,4,8]])

array([52746.82443607])

In [54]:
#now if i want to test the model create new csv file with area only and it will predict the price
H_pred=pd.read_csv("D:\SimpliLearn\Python\ML\hiring_predict.csv")
H_pred

   experience  test_score  interview
0           4           7          7
1           6           8          8
2           7           8          9

In [55]:
s=reg.predict(H_pred)

In [57]:
H_pred['salary']=s #creating a new colum salary

In [60]:
H_pred.to_csv("D:\SimpliLearn\Python\ML\hiring_predict.csv",index=False)